#include <iostream>
//---------------------------------------------------------------------------------
void foo_1(int arrX[],int size);
//---------------------------------------------------------------------------------
void foo_2(int arrX[],int size);
//---------------------------------------------------------------------------------
void print_Array(int arrX[],int size);
//---------------------------------------------------------------------------------
int main(){
    //---------------------------------------------------------------------------------
    /*
    1.Задать целочисленный массив,
    состоящий из элементов 0 и 1.
    Например: [ 1, 1, 0, 0, 1, 0, 1, 1, 0, 0 ].
    Написать функцию, заменяющую в принятом массиве 0 на 1, 1 на 0;
    */
    //---------------------------------------------------------------------------------
    const int SIZE = 10;
    int arr_1[SIZE] = { 1, 1, 0, 0, 1, 0, 1, 1, 0, 0 };

    print_Array(arr_1,SIZE);
    foo_1(arr_1,SIZE);
    print_Array(arr_1,SIZE);

    std::cout << "\n";
    //---------------------------------------------------------------------------------
    /*
    2.Задать пустой целочисленный массив размером 8.
    Написать функцию,
    которая с помощью цикла заполнит его значениями 1 4 7 10 13 16 19 22;
    */
    //---------------------------------------------------------------------------------
    const int SIZE_2 = 8;
    int arr_2[SIZE] = {0};
    print_Array(arr_2,SIZE_2);
    foo_2(arr_2,SIZE_2);
    print_Array(arr_2,SIZE_2);


	return 0;
}
//---------------------------------------------------------------------------------
void foo_1(int arrX[], int size){
    for(int index{0};index < size; ++index){
        if(arrX[index] == 0 ) {arrX[index] = 1;}
        else if (arrX[index] == 1 ) {arrX[index] = 0;}
    }
}
//---------------------------------------------------------------------------------
void foo_2(int arrX[], int size){
    for(int index{0};index < size; ++index){
        if(index == 0) arrX[index] = 1;
        else arrX[index] = arrX[index - 1] + 3;
    }
}
//---------------------------------------------------------------------------------
void print_Array(int arrX[],int size){
    for(int index{0};index < size; ++index){ std::cout << arrX[index] << "\t";}
    std::cout << std::endl;
}
//---------------------------------------------------------------------------------
