#include <iostream>
//---------------------------------------------------------------------------------
void foo_1(int arrX[],int size);
//---------------------------------------------------------------------------------
void print_Array(int arrX[],int size);
//---------------------------------------------------------------------------------
int main(){
    /*
    1.Задать целочисленный массив,
    состоящий из элементов 0 и 1.
    Например: [ 1, 1, 0, 0, 1, 0, 1, 1, 0, 0 ].
    Написать функцию, заменяющую в принятом массиве 0 на 1, 1 на 0;
    */
    const int SIZE = 10;
    int arr1[SIZE] = { 1, 1, 0, 0, 1, 0, 1, 1, 0, 0 };

    print_Array(arr1,SIZE);
    foo_1(arr1,SIZE);
    print_Array(arr1,SIZE);


	return 0;
}
//---------------------------------------------------------------------------------
void foo_1(int arrX[], int size){
    for(int index{0};index < size; ++index){
        if(arrX[index] == 0 ) {arrX[index] = 1;}
        else if (arrX[index] == 1 ) {arrX[index] = 0;}
    }
}
//---------------------------------------------------------------------------------
void print_Array(int arrX[],int size){
    for(int index{0};index < size; ++index){ std::cout << arrX[index] << "  ";}
    std::cout << std::endl;
}
//---------------------------------------------------------------------------------
